{
  "users": [
    { "id":1 ,"username": "dvir", "password": 1 },
    { "id":2 ,"username": "coral", "password": 123 },
    { "id":3 ,"username": "admin", "password": 1234 }
  ],
  "recipes": [
    { "title": "Pasta Pomadoro", "type": "main", "description": "Fill a large stock pot two-thirds full with water and heat over high to bring to a boil. Once you see the water start to steam, add 3 Tbsp. salt.", "image": "C:/Users/p0024269/Desktop/WebStudying/Exercise03/CookBook/images/pastaPomadoro.jpg", "fullRecipe": "In a large pot of boiling salted water, cook pasta according to package directions. Reserve ½ cup of pasta water, then drain. In another large pot over medium heat, heat oil. Add onion and cook until soft, 5 minutes. Add garlic and cook until fragrant, 1 minute more. Add tomatoes and cook until juices are released. Season with salt, pepper, and a pinch red pepper flakes. Reduce heat and let simmer for 15 minutes. Stir in basil. Add spaghetti and ¼ cup pasta water. Toss to combine. Add more pasta water to bring sauce together as needed. Garnish with more basil and Parmesan before serving." },
    { "title": "Greek Salad", "type": "starters", "description": "Known as horiatiki, this traditional Greek salad is made with cherry tomatoes, cucumber, kalamata olives, thinly sliced red onion, and feta.", "image": "C:/Users/p0024269/Desktop/WebStudying/Exercise03/CookBook/images/greekSalad.jpg", "fullRecipe": "Make salad: In a large bowl, stir together tomatoes, cucumber, olives, and red onion. Gently fold in feta. In a small bowl, make dressing: Combine vinegar, lemon juice, and oregano and season with salt and pepper. Slowly add olive oil, whisking to combine. Drizzle dressing over salad." },
    { "title": "Cheese Cake", "type": "dessert", "description": "Looking for the perfect cheesecake recipe? It takes a bit of hubris to describe a recipe as “perfect”, especially for something like cheesecake.", "image": "C:/Users/p0024269/Desktop/WebStudying/Exercise03/CookBook/images/cheeseCake.jpg", "fullRecipe": "Select a pie pan whose inside top dimension is at least 9. Make the crust by stirring together all of the crust ingredients, mixing until thoroughly combined. Press the crumbs into the bottom and up the sides of the pie pan, making a thicker layer on the bottom than on the sides. Make the filling by mixing together the room-temperature cream cheese and sugar until smooth. Mix in the eggs and vanilla, again mixing until smooth. To avoid beating too much air into the batter, use a mixer set at low-medium speed. To avoid lumps, make sure the cream cheese is softened, and/or at room temperature." },
    { "title": "Steak Picanha", "type": "main", "description": "Sprinkle steak with salt and pepper. In a large skillet, heat remaining butter over medium heat.", "image": "C:/Users/p0024269/Desktop/WebStudying/Exercise03/CookBook/images/steak.jpg", "fullRecipe": "Season the steaks with salt. Heat the oil in a frying pan large enough to fit both steaks, then add half the butter and once melted and foaming, add the garlic and thyme. Carefully put the steak in the pan and cook for 3 mins for rare, 4 mins for medium and 6 mins for well done, flip the steak and repeat. Once cooked, add a squeeze of lemon juice to the pan and spoon the lemony butter over the steak. Transfer the steaks to a warm plate and cover." },
    { "title": "Chocolate Balls", "type": "dessert", "description": "Crush the biscuits and place into a mixing bowl, Add cocoa and coconut, stir together then add condensed milk.", "image": "C:/Users/p0024269/Desktop/WebStudying/Exercise03/CookBook/images/ChocolateBalls.jpg", "fullRecipe": "ace the biscuits into the TM bowl. Crush by pressing Turbo 8-10 times or until the biscuits resemble fine crumbs. Add the cocoa powder, coconut and condensed milk. Mix on Reverse Speed 3 for 20 seconds or until well combined. Roll heaped teaspoons of the mixture into balls. Roll in the extra coconut to coat. Store in an airtight container for up to a week." }
  ],
  "profile": {
    "name": "DVIR"
  }
}
